Seoul-Young-Careers/NUCLEOG474RE/stm32g474/src/lib/cube_g474/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DS3120MG_1_Pin GPIO_PIN_0
#define DS3120MG_1_GPIO_Port GPIOA
#define LED_Pin GPIO_PIN_5
#define LED_GPIO_Port GPIOA
#define DM542_PUL_Pin GPIO_PIN_6
#define DM542_PUL_GPIO_Port GPIOA
#define DM542_DIR_Pin GPIO_PIN_7
#define DM542_DIR_GPIO_Port GPIOA
#define BUTTON_STOP_Pin GPIO_PIN_4
#define BUTTON_STOP_GPIO_Port GPIOC
#define BUTTON_RESET_Pin GPIO_PIN_5
#define BUTTON_RESET_GPIO_Port GPIOC
#define SN04_2_Pin GPIO_PIN_10
#define SN04_2_GPIO_Port GPIOB
#define bts7960_2_Pin GPIO_PIN_14
#define bts7960_2_GPIO_Port GPIOB
#define VALVE_2_Pin GPIO_PIN_7
#define VALVE_2_GPIO_Port GPIOC
#define SN04_1_Pin GPIO_PIN_8
#define SN04_1_GPIO_Port GPIOA
#define VALVE_1_Pin GPIO_PIN_9
#define VALVE_1_GPIO_Port GPIOA
#define BUTTON_START_Pin GPIO_PIN_10
#define BUTTON_START_GPIO_Port GPIOA
#define BUTTON_FOOT_Pin GPIO_PIN_3
#define BUTTON_FOOT_GPIO_Port GPIOB
#define Pump_Pin GPIO_PIN_6
#define Pump_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
